GetExternalFileReference Method
 Gets information pertaining to the external file referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ExternalFileReference GetExternalFileReference()
Visual Basic
Public Function GetExternalFileReference As ExternalFileReference
Visual C++
public:
ExternalFileReference^ GetExternalFileReference()
Return Value
 An object containing path and type information for the external file referenced by the element.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  This Element does not represent an external file.
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →